In [1]:
import pandas as pd
import numpy as np

In [3]:
data = {
    "names" : ["Ramesh", "Suresh", None, "Mahesh"],
    "age" : [20, 22, 24, None],
    "City" : [None, "Chennai", "Pune", "Mumbai"]
}

df1 = pd.DataFrame(data)

df1

    names   age     City
0  Ramesh  20.0      NaN
1  Suresh  22.0  Chennai
2     NaN  24.0     Pune
3  Mahesh   NaN   Mumbai

        - Even Though we provided None, the numerical by default NaN

        - Categorical columns takes a None

In [5]:
df1.dtypes

names        str
age      float64
City         str
dtype: object

In [6]:
df1.isnull().sum()

names    1
age      1
City     1
dtype: int64

In [9]:
df1.dropna(subset = "age")

    names   age     City
0  Ramesh  20.0      NaN
1  Suresh  22.0  Chennai
2     NaN  24.0     Pune